[
  {
    "crop": "Corn",
    "disease": "Common Rust",
    "symptoms": "Small, round to elongated reddish-brown pustules appear on both leaf surfaces, often in scattered patches.",
    "treatment": "Use resistant hybrids. If severe, apply fungicides like Mancozeb or Propiconazole at recommended doses."
  },
  {
    "crop": "Corn",
    "disease": "Gray Leaf Spot",
    "symptoms": "Narrow, rectangular gray to tan lesions running parallel between leaf veins. Severe infection causes premature leaf death.",
    "treatment": "Adopt crop rotation, use resistant hybrids, and apply fungicides like Azoxystrobin or Trifloxystrobin when needed."
  },
  {
    "crop": "Corn",
    "disease": "Healthy",
    "symptoms": "No visible disease symptoms, green and healthy leaves.",
    "treatment": "No treatment required. Maintain good crop management practices."
  },
  {
    "crop": "Corn",
    "disease": "Northern Leaf Blight",
    "symptoms": "Cigar-shaped gray-green lesions on leaves, which later turn tan with dark borders.",
    "treatment": "Use resistant hybrids. Apply fungicides like Mancozeb, Tebuconazole, or Azoxystrobin if incidence is high."
  },
  {
    "crop": "Potato",
    "disease": "Early Blight",
    "symptoms": "Dark brown concentric rings on older leaves. Yellowing around lesions; severe cases cause leaf drop.",
    "treatment": "Spray Mancozeb (0.2%) or Chlorothalonil. Use disease-free certified seed tubers."
  },
  {
    "crop": "Potato",
    "disease": "Healthy",
    "symptoms": "No visible disease symptoms, vigorous growth observed.",
    "treatment": "No treatment required. Ensure proper irrigation and nutrient management."
  },
  {
    "crop": "Potato",
    "disease": "Late Blight",
    "symptoms": "Water-soaked dark lesions on leaves, often with white fungal growth on undersides during humid conditions.",
    "treatment": "Spray Metalaxyl + Mancozeb (0.25%) or Cymoxanil + Mancozeb at 7–10 day intervals. Remove infected plants."
  },
  {
    "crop": "Rice",
    "disease": "Brown Spot",
    "symptoms": "Small, circular to oval dark brown spots with yellow halos on leaves and seeds.",
    "treatment": "Treat seed with fungicides before sowing. Apply Mancozeb (0.25%) or Propiconazole. Maintain balanced fertilization."
  },
  {
    "crop": "Rice",
    "disease": "Healthy",
    "symptoms": "Green healthy leaves and tillers, no disease observed.",
    "treatment": "No treatment required. Maintain proper spacing and irrigation."
  },
  {
    "crop": "Rice",
    "disease": "Leaf Blast",
    "symptoms": "Spindle-shaped lesions with gray centers and brown margins on leaves.",
    "treatment": "Spray Tricyclazole (0.6 g/l) or Isoprothiolane. Avoid excess nitrogen and maintain proper plant spacing."
  },
  {
    "crop": "Rice",
    "disease": "Neck Blast",
    "symptoms": "Neck of the panicle turns brown/black, panicles remain unfilled or partially filled.",
    "treatment": "Spray Tricyclazole (0.6 g/l) at booting stage and repeat at flowering stage. Use resistant varieties."
  },
  {
    "crop": "Wheat",
    "disease": "Brown Rust",
    "symptoms": "Small, orange-brown pustules appear scattered on leaves and stems.",
    "treatment": "Spray Propiconazole (0.1%) or Mancozeb. Grow rust-resistant varieties."
  },
  {
    "crop": "Wheat",
    "disease": "Healthy",
    "symptoms": "Green leaves and healthy tillers, no disease found.",
    "treatment": "No treatment required. Maintain crop hygiene and irrigation schedules."
  },
  {
    "crop": "Wheat",
    "disease": "Yellow Rust",
    "symptoms": "Yellow linear stripes of powdery pustules appear on leaves, mostly during cool and wet weather.",
    "treatment": "Spray Tebuconazole (0.1%) or Propiconazole. Grow resistant varieties and monitor fields regularly."
  },
  {
    "crop": "Sugarcane",
    "disease": "Red Rot",
    "symptoms": "Leaves with red streaks, stalks show red discolored pith with a sour smell.",
    "treatment": "Destroy infected clumps. Use resistant varieties. Apply fungicide-treated setts before planting."
  },
  {
    "crop": "Sugarcane",
    "disease": "Healthy",
    "symptoms": "Green and tall canes with no disease symptoms.",
    "treatment": "No treatment required. Maintain proper soil nutrition and irrigation."
  },
  {
    "crop": "Sugarcane",
    "disease": "Bacterial Blight",
    "symptoms": "Yellowish-white leaf streaks starting from tip, leaves may wither and dry prematurely.",
    "treatment": "Use disease-free seed setts. Hot water treatment (50°C for 30 min) of seed cane. Use resistant varieties."
  }
]